raw = [
	{'name': '不良贷款控制', 'children': [{'name': '个人不良贷款', 'children': [{'name': '个人不良贷款控制计划完成率'}]}]},
	{'name': '财富管理', 'children': [{'name': '零售渠道理财日均', 'children': [{'name': '本行理财保有量余额'}]}]},
	{'name': '财富管理', 'children': [{'name': '零售渠道理财日均', 'children': [{'name': '本行理财保有量余额_上年末'}]}]},
	{'name': '财富管理', 'children': [{'name': '零售渠道理财日均', 'children': [{'name': '家族信托投资理财（私行）余额'}]}]},
	{'name': '财富管理',
	 'children': [
		 {'name': '零售渠道理财日均',
		  'children': [
			  {'name': '家族信托投资理财（私行）余额_上年末'}
			  ]
		  }
	 ]
	 },
]










d1 = {
	'不良贷款控制': ['个人不良贷款', '个人不良贷款控制计划完成率'],
	'财富管理': ['零售渠道理财日均', '零售渠道理财年日均余额增量计划完成率'],
	'规模': ['零售管理资产增长', '同业AUM月末均余额增量排名'],
	'客户规模': ['客户数', '无效客户数'],
	'客户获取': ['信用卡新增客户', '信用卡新增客户计划完成率'],
	'客户增长': ['私人银行客户增长', '私人银行客户分层折算系数'],
	'零售客户拓展': ['信用卡新增客户', '信用卡新增客户增长率'],
	'普惠金融': ['涉农个人贷款', '涉农个人贷款增量计划目标完成率'],
	'全客户“五主”综合经营-主服务客户增长': ['企业微信认证率', '富裕及以上客户企业微信认证率'],
	'全客户“五主”综合经营-主结算客户增长': ['移动支付月活跃合约数计划完成率', '移动支付月活跃合约数计划完成率'],
	'全客户“五主”综合经营-主融资客户增长': ['信用贷获客能力', '考核口径信用贷首签客户数'],
	'全客户“五主”综合经营-主投资客户增长': ['养老金账户', '养老金缴存客户数计划完成率'],
	'效益': ['零售轻资本业务收入', '保险中收计划完成率'],
	'新客户“五主”基础动作': ['信用卡新客户“一户三绑”', '信用卡新客借贷关联签约率'],
	'重点领域信贷支持': ['个人消费贷款', '个人消费贷款增量计划完成率']}





